title: Account Creation Detection
id: ac-001
status: experimental

description: Detects creation of new user accounts.

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4720
  condition: selection

level: medium

tags:
  - attack.t1136
