title: Brute Force Detection
id: bf-001
status: experimental

description: Detects repeated failed logon attempts.

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4625
  condition: selection

level: high

tags:
  - attack.t1110
