title: Brute Force Detection
id: 06f20b76-af05-4008-9fb2-974c2699c6e1
status: experimental

description: Detects repeated failed logon attempts.

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4625
  condition: selection

level: high

tags:
  - attack.t1110

author: Thabo Sakonta

date: 2026/07/20

references:
  - https://attack.mitre.org/techniques/T1110/

falsepositives:
  - Users forgetting passwords
  - Automated service authentication failures

fields:
  - TargetUserName
  - IpAddress
  - WorkstationName
