title: PowerShell Execution Detection
id: 0393073a-3011-4622-a1de-e32d6569228b
status: experimental

description: Detects PowerShell execution activity.

logsource:
  product: windows

detection:
  selection:
    Process: powershell.exe
  condition: selection

level: high

tags:
  - attack.execution
  - attack.t1059.001
