title: Privilege Escalation Detection
id: 8afad09f-3888-4f0b-8c0f-6e951b8a01fe
status: experimental

description: Detects privileged account activity.

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4672
  condition: selection

level: high

tags:
  - attack.t1078
