title: Privilege Escalation Detection
id: pe-001
status: experimental

description: Detects privileged account activity.

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4672
  condition: selection

level: high

tags:
  - attack.t1078
